theatrus/ksdk/platform/CMSIS/Include/device/MK63F12/MK63F12_registers.h
/*
 * Constants & macros for individual CAU_STR_CA0 bitfields
 */

/*!
 * @name Register CAU_STR_CA0, field CA0[31:0] (RO)
 */
/*@{*/
#define BP_CAU_STR_CA0_CA0   (0U)          /*!< Bit position for CAU_STR_CA0_CA0. */
#define BM_CAU_STR_CA0_CA0   (0xFFFFFFFFU) /*!< Bit mask for CAU_STR_CA0_CA0. */
#define BS_CAU_STR_CA0_CA0   (32U)         /*!< Bit field size in bits for CAU_STR_CA0_CA0. */

/*! @brief Read current value of the CAU_STR_CA0_CA0 field. */
#define BR_CAU_STR_CA0_CA0(x) (HW_CAU_STR_CA0(x).U)
/*@}*/

/*******************************************************************************
 * HW_CAU_STR_CA1 - General Purpose Register 1 - Store Register command
 ******************************************************************************/

/*!
 * @brief HW_CAU_STR_CA1 - General Purpose Register 1 - Store Register command (RO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_str_ca1
{
    uint32_t U;
    struct _hw_cau_str_ca1_bitfields
    {
        uint32_t CA1 : 32;             /*!< [31:0] CA1 */
    } B;
} hw_cau_str_ca1_t;

/*!
 * @name Constants and macros for entire CAU_STR_CA1 register
 */
/*@{*/
#define HW_CAU_STR_CA1_ADDR(x)   ((uint32_t)(x) + 0x88CU)

#define HW_CAU_STR_CA1(x)        (*(__I hw_cau_str_ca1_t *) HW_CAU_STR_CA1_ADDR(x))
#define HW_CAU_STR_CA1_RD(x)     (HW_CAU_STR_CA1(x).U)
/*@}*/

/*
 * Constants & macros for individual CAU_STR_CA1 bitfields
 */

/*!
 * @name Register CAU_STR_CA1, field CA1[31:0] (RO)
 */
/*@{*/
#define BP_CAU_STR_CA1_CA1   (0U)          /*!< Bit position for CAU_STR_CA1_CA1. */
#define BM_CAU_STR_CA1_CA1   (0xFFFFFFFFU) /*!< Bit mask for CAU_STR_CA1_CA1. */
#define BS_CAU_STR_CA1_CA1   (32U)         /*!< Bit field size in bits for CAU_STR_CA1_CA1. */

/*! @brief Read current value of the CAU_STR_CA1_CA1 field. */
#define BR_CAU_STR_CA1_CA1(x) (HW_CAU_STR_CA1(x).U)
/*@}*/

/*******************************************************************************
 * HW_CAU_STR_CA2 - General Purpose Register 2 - Store Register command
 ******************************************************************************/

/*!
 * @brief HW_CAU_STR_CA2 - General Purpose Register 2 - Store Register command (RO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_str_ca2
{
    uint32_t U;
    struct _hw_cau_str_ca2_bitfields
    {
        uint32_t CA2 : 32;             /*!< [31:0] CA2 */
    } B;
} hw_cau_str_ca2_t;

/*!
 * @name Constants and macros for entire CAU_STR_CA2 register
 */
/*@{*/
#define HW_CAU_STR_CA2_ADDR(x)   ((uint32_t)(x) + 0x890U)

#define HW_CAU_STR_CA2(x)        (*(__I hw_cau_str_ca2_t *) HW_CAU_STR_CA2_ADDR(x))
#define HW_CAU_STR_CA2_RD(x)     (HW_CAU_STR_CA2(x).U)
/*@}*/

/*
 * Constants & macros for individual CAU_STR_CA2 bitfields
 */

/*!
 * @name Register CAU_STR_CA2, field CA2[31:0] (RO)
 */
/*@{*/
#define BP_CAU_STR_CA2_CA2   (0U)          /*!< Bit position for CAU_STR_CA2_CA2. */
#define BM_CAU_STR_CA2_CA2   (0xFFFFFFFFU) /*!< Bit mask for CAU_STR_CA2_CA2. */
#define BS_CAU_STR_CA2_CA2   (32U)         /*!< Bit field size in bits for CAU_STR_CA2_CA2. */

/*! @brief Read current value of the CAU_STR_CA2_CA2 field. */
#define BR_CAU_STR_CA2_CA2(x) (HW_CAU_STR_CA2(x).U)
/*@}*/

/*******************************************************************************
 * HW_CAU_STR_CA3 - General Purpose Register 3 - Store Register command
 ******************************************************************************/

/*!
 * @brief HW_CAU_STR_CA3 - General Purpose Register 3 - Store Register command (RO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_str_ca3
{
    uint32_t U;
    struct _hw_cau_str_ca3_bitfields
    {
        uint32_t CA3 : 32;             /*!< [31:0] CA3 */
    } B;
} hw_cau_str_ca3_t;

/*!
 * @name Constants and macros for entire CAU_STR_CA3 register
 */
/*@{*/
#define HW_CAU_STR_CA3_ADDR(x)   ((uint32_t)(x) + 0x894U)

#define HW_CAU_STR_CA3(x)        (*(__I hw_cau_str_ca3_t *) HW_CAU_STR_CA3_ADDR(x))
#define HW_CAU_STR_CA3_RD(x)     (HW_CAU_STR_CA3(x).U)
/*@}*/

/*
 * Constants & macros for individual CAU_STR_CA3 bitfields
 */

/*!
 * @name Register CAU_STR_CA3, field CA3[31:0] (RO)
 */
/*@{*/
#define BP_CAU_STR_CA3_CA3   (0U)          /*!< Bit position for CAU_STR_CA3_CA3. */
#define BM_CAU_STR_CA3_CA3   (0xFFFFFFFFU) /*!< Bit mask for CAU_STR_CA3_CA3. */
#define BS_CAU_STR_CA3_CA3   (32U)         /*!< Bit field size in bits for CAU_STR_CA3_CA3. */

/*! @brief Read current value of the CAU_STR_CA3_CA3 field. */
#define BR_CAU_STR_CA3_CA3(x) (HW_CAU_STR_CA3(x).U)
/*@}*/

/*******************************************************************************
 * HW_CAU_STR_CA4 - General Purpose Register 4 - Store Register command
 ******************************************************************************/

/*!
 * @brief HW_CAU_STR_CA4 - General Purpose Register 4 - Store Register command (RO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_str_ca4
{
    uint32_t U;
    struct _hw_cau_str_ca4_bitfields
    {
        uint32_t CA4 : 32;             /*!< [31:0] CA4 */
    } B;
} hw_cau_str_ca4_t;

/*!
 * @name Constants and macros for entire CAU_STR_CA4 register
 */
/*@{*/
#define HW_CAU_STR_CA4_ADDR(x)   ((uint32_t)(x) + 0x898U)

#define HW_CAU_STR_CA4(x)        (*(__I hw_cau_str_ca4_t *) HW_CAU_STR_CA4_ADDR(x))
#define HW_CAU_STR_CA4_RD(x)     (HW_CAU_STR_CA4(x).U)
/*@}*/

/*
 * Constants & macros for individual CAU_STR_CA4 bitfields
 */

/*!
 * @name Register CAU_STR_CA4, field CA4[31:0] (RO)
 */
/*@{*/
#define BP_CAU_STR_CA4_CA4   (0U)          /*!< Bit position for CAU_STR_CA4_CA4. */
#define BM_CAU_STR_CA4_CA4   (0xFFFFFFFFU) /*!< Bit mask for CAU_STR_CA4_CA4. */
#define BS_CAU_STR_CA4_CA4   (32U)         /*!< Bit field size in bits for CAU_STR_CA4_CA4. */

/*! @brief Read current value of the CAU_STR_CA4_CA4 field. */
#define BR_CAU_STR_CA4_CA4(x) (HW_CAU_STR_CA4(x).U)
/*@}*/

